[
  {
    "key": 1,
    "title": "Piczoid",
    "imageSrc": "projects/piczoid.png",
    "description": "Piczoid is a full-stack Instagram clone built with React, designed for users to create, share, and interact with visual content in a social media environment. It features core functionalities like user authentication, real-time posts and comments, and a sleek UI for viewing, liking, and commenting on photos. The project combines frontend and backend technologies to deliver a seamless and engaging user experience similar to Instagram.",
    "demo": "https://piczoid.onrender.com/",
    "source": "https://github.com/Monty4011/Piczoid"
  },
  {
    "key": 2,
    "title": "WanderWise",
    "imageSrc": "projects/wanderwise.png",
    "description": "WanderWise is an AI-powered trip planner web app designed to simplify travel planning. It provides personalized itineraries, suggests destinations, and optimizes routes based on user preferences, making every journey seamless and enjoyable.",
    "demo": "https://ai-trip-planner-r2gf.onrender.com/",
    "source": "https://github.com/Monty4011/ai-trip-planner"
  },
  {
    "key": 3,
    "title": "Job Dekho",
    "imageSrc": "projects/jobdekho.png",
    "description": "Job Dekho is a full-stack job portal website built with React, aimed at connecting job seekers with potential employers. The platform offers features such as job listings, application tracking, user profiles, and search filters to streamline the job search process. With a responsive design and user-friendly interface, Job Dekho provides a seamless experience for users looking to find or post job opportunities.",
    "source": "https://github.com/Monty4011/Job-Portal"
  },
  {
    "key": 4,
    "title": "Dice Game",
    "imageSrc": "projects/dice.png",
    "description": "This dice game project is a full-stack application built with React, featuring interactive gameplay where users roll dice and track their scores. The game includes engaging animations, scorekeeping,  making it fun and easy to play. Designed with an intuitive interface and real-time updates, it offers an enjoyable gaming experience for players.",
    "source": "https://github.com/Monty4011/Dice-Game"
  },
  {
    "key": 5,
    "title": "PassOP",
    "imageSrc": "projects/passop.png",
    "description": "This password manager project is a full-stack React application designed to securely store, organize, and retrieve user passwords. It includes robust features such as encryption, secure authentication, and an intuitive UI for managing login credentials. The app allows users to safely store passwords and retrieve them with ease, enhancing security and user convenience.",
    "source": "https://github.com/Monty4011/Password-Manager"
  }
]
